app/controllers/api/events_controller.rb

SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."url" = $1 LIMIT $2  [["url", "http://registered_application.com"], ["LIMIT", 1]]
INSERT INTO "events" ("name", "registered_application_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "foobar"], ["registered_application_id", 17], ["created_at", 2016-07-22 21:08:43 UTC], ["updated_at", 2016-07-22 21:08:43 UTC]]
---
  def create
    registered_application = RegisteredApplication.find_by(url: request.env['HTTP_ORIGIN'])
    event = registered_application.events.new(event_params)

    if event.valid?
      event.save!