app/views/registered_applications/show.html.erb

SELECT "events".* FROM "events" WHERE "events"."registered_application_id" = ?  [["registered_application_id", 6]]
SELECT COUNT(*) FROM "events" WHERE "events"."registered_application_id" = ?  [["registered_application_id", 6]]
---

        <%= pie_chart @registered_application.events.group(:name).count %>