app/views/users/show.html.erb

        <h3>Your sites</h3>
        <% if @user.registered_applications.any? %>
---
SELECT  1 AS one FROM "registered_applications" WHERE "registered_applications"."user_id" = ? LIMIT ?  [["user_id", 3], ["LIMIT", 1]]
SELECT "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."user_id" = ?  [["user_id", 3]]