app/controllers/registered_applications_controller.rb

  def show
    @registered_application = RegisteredApplication.find(params[:id])
    @events = @registered_application.events.group_by(&:name)
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."registered_application_id" = ?  [["registered_application_id", 6]]

  def create
    @user = current_user
    @registered_application = @user.registered_applications.build(registered_application_params)

    if @registered_application.save
---
INSERT INTO "registered_applications" ("name", "url", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Home"], ["url", "localhost:3000"], ["user_id", 6], ["created_at", 2016-07-22 21:04:58 UTC], ["updated_at", 2016-07-22 21:04:58 UTC]]

  def destroy

    @user = current_user
    @registered_application = RegisteredApplication.find(params[:id])

    binding.pry
    if @registered_application.destroy
---
SELECT  "registered_applications".* FROM "registered_applications" WHERE "registered_applications"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
DELETE FROM "registered_applications" WHERE "registered_applications"."id" = ?  [["id", 2]]